# 편의점 재고 리스트
inventory = ["콜라", "사이다", "삼각김밥", "라면", "껌", "맥주"]

print(f"현재 재고: {inventory}")
print("어서오세요! GS25입니다. 🏪")

# 손님이 찾는 물건
customer_want = input("찾으시는 물건이 무엇인가요? : ")
is_exist = False # 재고 있음 여부

# 선형 탐색 시작
for i in range(len(inventory)):
    # 문자열 비교 (같으면 True)
    if inventory[i] == customer_want:
        # i는 0부터 시작하므로, 손님에게는 +1 해서 알려줌
        print(f"📢 손님, '{customer_want}'(은)는 {i+1}번째 칸에 있습니다!")
        is_exist = True
        break

# 반복문이 끝난 후 확인
if not is_exist: # if is_exist == False: 와 같음
    print(f"죄송합니다. '{customer_want}'(은)는 다 팔렸습니다. ㅠㅠ")
